qhr1993/livequest_nrf_target/nRF5_SDK_11.0.0_89a8197/external/LoRaMac_revision/radio/sx1276/sx1276.c
void SX1276Reset( void )
{
    // Set RESET pin to 0
    //GpioInit( &SX1276.Reset, RADIO_RESET, PIN_OUTPUT, PIN_PUSH_PULL, PIN_NO_PULL, 0 );
    nrf_drv_gpiote_in_uninit(RADIO_RESET);
		nrf_drv_gpiote_out_config_t cfgTmpOut = GPIOTE_CONFIG_OUT_SIMPLE(0);
    SX1276.Reset_out = cfgTmpOut;
    nrf_drv_gpiote_out_init(RADIO_RESET,&(SX1276.Reset_out));

    // Wait 1 ms
    DelayMs( 1 );

    nrf_drv_gpiote_out_uninit(RADIO_RESET);

    // Configure RESET as input
    //GpioInit( &SX1276.Reset, RADIO_RESET, PIN_INPUT, PIN_PUSH_PULL, PIN_NO_PULL, 1 );
		nrf_drv_gpiote_in_config_t cfgTmpIn =  	GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);
    SX1276.Reset_in = cfgTmpIn;
    nrf_drv_gpiote_in_init(RADIO_RESET,&(SX1276.Reset_in),NULL);

    // Wait 6 ms
    DelayMs( 6 );
}

void SX1276SetOpMode( uint8_t opMode )
{
    if( opMode == RF_OPMODE_SLEEP )
    {
        SX1276SetAntSwLowPower( true );
    }
    else
    {
        SX1276SetAntSwLowPower( false );
        SX1276SetAntSw( opMode );
    }
    SX1276Write( REG_OPMODE, ( SX1276Read( REG_OPMODE ) & RF_OPMODE_MASK ) | opMode );
}

void SX1276SetModem( RadioModems_t modem )
{
    //assert_param( ( SX1276.Spi.Spi.Instance != NULL ) );

    if( ( SX1276Read( REG_OPMODE ) & RFLR_OPMODE_LONGRANGEMODE_ON ) != 0 )
    {
        SX1276.Settings.Modem = MODEM_LORA;
    }
    else
    {
        SX1276.Settings.Modem = MODEM_FSK;
    }

    if( SX1276.Settings.Modem == modem )
    {
        return;
    }

    SX1276.Settings.Modem = modem;
    switch( SX1276.Settings.Modem )
    {
    default:
    case MODEM_FSK:
        SX1276SetSleep( );
        SX1276Write( REG_OPMODE, ( SX1276Read( REG_OPMODE ) & RFLR_OPMODE_LONGRANGEMODE_MASK ) | RFLR_OPMODE_LONGRANGEMODE_OFF );

        SX1276Write( REG_DIOMAPPING1, 0x00 );
        SX1276Write( REG_DIOMAPPING2, 0x30 ); // DIO5=ModeReady
        break;
    case MODEM_LORA:
        SX1276SetSleep( );
        SX1276Write( REG_OPMODE, ( SX1276Read( REG_OPMODE ) & RFLR_OPMODE_LONGRANGEMODE_MASK ) | RFLR_OPMODE_LONGRANGEMODE_ON );

        SX1276Write( REG_DIOMAPPING1, 0x00 );
        SX1276Write( REG_DIOMAPPING2, 0x00 );
        break;
    }
}

void SX1276Write( uint8_t addr, uint8_t data )
{
    SX1276WriteBuffer( addr, &data, 1 );
}

uint8_t SX1276Read( uint8_t addr )
{
    uint8_t data;
    SX1276ReadBuffer( addr, &data, 1 );
    return data;
}

void SX1276WriteBuffer( uint8_t addr, uint8_t *buffer, uint8_t size )
{
    //uint8_t i;

    //NSS = 0;
    // GpioWrite( &SX1276.Spi.Nss, 0 );

    // SpiInOut( &SX1276.Spi, addr | 0x80 );
    // for( i = 0; i < size; i++ )
    // {
    //     SpiInOut( &SX1276.Spi, buffer[i] );
    // }

    // //NSS = 1;
    // GpioWrite( &SX1276.Spi.Nss, 1 );
    uint8_t opcode = (addr | 0x80);
    nrf_drv_spi_transfer(&(SX1276.Spi_master), &opcode,1,NULL,0);
    nrf_drv_spi_transfer(&(SX1276.Spi_master), buffer,size,NULL,0);

}

void SX1276ReadBuffer( uint8_t addr, uint8_t *buffer, uint8_t size )
{
    //uint8_t i;

    //NSS = 0;
    // GpioWrite( &SX1276.Spi.Nss, 0 );

    // SpiInOut( &SX1276.Spi, addr & 0x7F );

    // for( i = 0; i < size; i++ )
    // {
    //     buffer[i] = SpiInOut( &SX1276.Spi, 0 );
    // }

    // //NSS = 1;
    // GpioWrite( &SX1276.Spi.Nss, 1 );
    uint8_t opcode = (addr | 0x7F);
    nrf_drv_spi_transfer(&(SX1276.Spi_master), &opcode,1,NULL,0);
    nrf_drv_spi_transfer(&(SX1276.Spi_master), NULL,0,buffer,size);
}

void SX1276WriteFifo( uint8_t *buffer, uint8_t size )
{
    SX1276WriteBuffer( 0, buffer, size );
}

void SX1276ReadFifo( uint8_t *buffer, uint8_t size )
{
    SX1276ReadBuffer( 0, buffer, size );
}

void SX1276SetMaxPayloadLength( RadioModems_t modem, uint8_t max )
{
    SX1276SetModem( modem );

    switch( modem )
    {
    case MODEM_FSK:
        if( SX1276.Settings.Fsk.FixLen == false )
        {
            SX1276Write( REG_PAYLOADLENGTH, max );
        }
        break;
    case MODEM_LORA:
        SX1276Write( REG_LR_PAYLOADMAXLENGTH, max );
        break;
    }
}

void SX1276SetPublicNetwork( bool enable )
{
    SX1276SetModem( MODEM_LORA );
    SX1276.Settings.LoRa.PublicNetwork = enable;
    if( enable == true )
    {
        // Change LoRa modem SyncWord
        SX1276Write( REG_LR_SYNCWORD, LORA_MAC_PUBLIC_SYNCWORD );
    }
    else
    {
        // Change LoRa modem SyncWord
        SX1276Write( REG_LR_SYNCWORD, LORA_MAC_PRIVATE_SYNCWORD );
    }
}

void SX1276OnTimeoutIrq( void *p_context )
{
    switch( SX1276.Settings.State )
    {
    case RF_RX_RUNNING:
        if( SX1276.Settings.Modem == MODEM_FSK )
        {
            SX1276.Settings.FskPacketHandler.PreambleDetected = false;
            SX1276.Settings.FskPacketHandler.SyncWordDetected = false;
            SX1276.Settings.FskPacketHandler.NbBytes = 0;
            SX1276.Settings.FskPacketHandler.Size = 0;

            // Clear Irqs
            SX1276Write( REG_IRQFLAGS1, RF_IRQFLAGS1_RSSI |
                                        RF_IRQFLAGS1_PREAMBLEDETECT |
                                        RF_IRQFLAGS1_SYNCADDRESSMATCH );
            SX1276Write( REG_IRQFLAGS2, RF_IRQFLAGS2_FIFOOVERRUN );

            if( SX1276.Settings.Fsk.RxContinuous == true )
            {
                // Continuous mode restart Rx chain
                SX1276Write( REG_RXCONFIG, SX1276Read( REG_RXCONFIG ) | RF_RXCONFIG_RESTARTRXWITHOUTPLLLOCK );
                //TimerStart( &RxTimeoutSyncWord );
				app_timer_start(RxTimeoutSyncWord, APP_TIMER_TICKS(RxTimeoutSyncWordTime, APP_TIMER_PRESCALER), NULL);

            }
            else
            {
                SX1276.Settings.State = RF_IDLE;
                //TimerStop( &RxTimeoutSyncWord );
				app_timer_stop(RxTimeoutSyncWord);
            }
        }
        if( ( RadioEvents != NULL ) && ( RadioEvents->RxTimeout != NULL ) )
        {
            RadioEvents->RxTimeout( );
        }
        break;
    case RF_TX_RUNNING:
        // Tx timeout shouldn't happen.
        // But it has been observed that when it happens it is a result of a corrupted SPI transfer
        // it depends on the platform design.
        // 
        // The workaround is to put the radio in a known state. Thus, we re-initialize it.

